In [25]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [26]:
df = pd.read_csv("Data/Churn_Modelling_refactor.csv")

In [27]:
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2.0,0.00,1,1,1.0,101348.88,1.0
1,2,15647311,Hill,608,Spain,Female,41,1.0,83807.86,1,0,1.0,112542.58,0.0
2,3,15619304,Onio,502,France,Female,42,8.0,159660.80,3,1,0.0,113931.57,1.0
3,4,15701354,Boni,699,France,Female,39,1.0,0.00,2,0,0.0,93826.63,0.0
4,5,15737888,Mitchell,850,Spain,Female,43,2.0,125510.82,1,1,1.0,79084.10,0.0

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           10000 non-null  object
 6   Age              10000 non-null  object
 7   Tenure           10000 non-null  float64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  float64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           9970 non-null   float64
dtypes: float64(5), int64(5), object(4)
memory usage: 1.1+ MB

In [16]:
print(df.isnull().sum())

RowNumber           0
CustomerId          0
Surname             0
CreditScore         0
Geography           0
Gender              0
Age                 0
Tenure              0
Balance             0
NumOfProducts       0
HasCrCard           0
IsActiveMember      0
EstimatedSalary     0
Exited             30
dtype: int64

In [29]:
updated_df = df.dropna(axis=0)

In [30]:
updated_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9970 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        9970 non-null   int64
 1   CustomerId       9970 non-null   int64
 2   Surname          9970 non-null   object
 3   CreditScore      9970 non-null   int64
 4   Geography        9970 non-null   object
 5   Gender           9970 non-null   object
 6   Age              9970 non-null   object
 7   Tenure           9970 non-null   float64
 8   Balance          9970 non-null   float64
 9   NumOfProducts    9970 non-null   int64
 10  HasCrCard        9970 non-null   int64
 11  IsActiveMember   9970 non-null   float64
 12  EstimatedSalary  9970 non-null   float64
 13  Exited           9970 non-null   float64
dtypes: float64(5), int64(5), object(4)
memory usage: 1.1+ MB